; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob14) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate4)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate2)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot0)
	(clear crate6)
	(at pallet7 distributor0)
	(clear pallet7)
	(at pallet8 depot2)
	(clear pallet8)
	(at pallet9 distributor2)
	(clear crate0)
	(at pallet10 distributor0)
	(clear pallet10)
	(at pallet11 depot1)
	(clear crate5)
	(at pallet12 distributor0)
	(clear pallet12)
	(at pallet13 depot2)
	(clear pallet13)
	(at truck0 depot1)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at crate0 distributor2)
	(on crate0 pallet9)
	(at crate1 depot0)
	(on crate1 pallet6)
	(at crate2 distributor0)
	(on crate2 pallet3)
	(at crate3 depot1)
	(on crate3 pallet11)
	(at crate4 depot1)
	(on crate4 pallet1)
	(at crate5 depot1)
	(on crate5 crate3)
	(at crate6 depot0)
	(on crate6 crate1)
)

(:goal (and
		(on crate0 pallet8)
		(on crate1 pallet1)
		(on crate2 pallet10)
		(on crate4 pallet7)
		(on crate5 pallet13)
		(on crate6 pallet12)
	)
))

; plan
1. (lift hoist0 crate6 crate1 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate1)
   added: (lifting hoist0 crate6) (clear crate1)
   goals met: 0 of 6
2. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   goals met: 0 of 6
3. (lift hoist0 crate1 pallet6 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet6)
   added: (lifting hoist0 crate1) (clear pallet6)
   goals met: 0 of 6
4. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 0 of 6
5. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 0 of 6
6. (lift hoist8 crate0 pallet9 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist8) (on crate0 pallet9)
   added: (lifting hoist8 crate0) (clear pallet9)
   goals met: 0 of 6
7. (lift hoist7 crate2 pallet3 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist7) (on crate2 pallet3)
   added: (lifting hoist7 crate2) (clear pallet3)
   goals met: 0 of 6
8. (drop hoist7 crate2 pallet10 distributor0)
   deleted: (lifting hoist7 crate2) (clear pallet10)
   added: (available hoist7) (at crate2 distributor0) (clear crate2) (on crate2 pallet10)
   goals met: 1 of 6
9. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 1 of 6
10. (unload hoist7 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist7)
   added: (lifting hoist7 crate6)
   goals met: 1 of 6
11. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 1 of 6
12. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 1 of 6
13. (load hoist8 crate0 truck0 distributor2)
   deleted: (lifting hoist8 crate0)
   added: (in crate0 truck0) (available hoist8)
   goals met: 1 of 6
14. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 1 of 6
15. (unload hoist6 crate0 truck0 depot2)
   deleted: (in crate0 truck0) (available hoist6)
   added: (lifting hoist6 crate0)
   goals met: 1 of 6
16. (drop hoist7 crate6 pallet12 distributor0)
   deleted: (lifting hoist7 crate6) (clear pallet12)
   added: (available hoist7) (at crate6 distributor0) (clear crate6) (on crate6 pallet12)
   goals met: 2 of 6
17. (drop hoist6 crate0 pallet8 depot2)
   deleted: (lifting hoist6 crate0) (clear pallet8)
   added: (available hoist6) (at crate0 depot2) (clear crate0) (on crate0 pallet8)
   goals met: 3 of 6
18. (lift hoist1 crate4 pallet1 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 pallet1)
   added: (lifting hoist1 crate4) (clear pallet1)
   goals met: 3 of 6
19. (load hoist1 crate4 truck1 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 3 of 6
20. (unload hoist1 crate1 truck1 depot1)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 3 of 6
21. (drop hoist1 crate1 pallet1 depot1)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at crate1 depot1) (clear crate1) (on crate1 pallet1)
   goals met: 4 of 6
22. (lift hoist1 crate5 crate3 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 crate3)
   added: (lifting hoist1 crate5) (clear crate3)
   goals met: 4 of 6
23. (load hoist1 crate5 truck1 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   goals met: 4 of 6
24. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 4 of 6
25. (unload hoist6 crate5 truck1 depot2)
   deleted: (in crate5 truck1) (available hoist6)
   added: (lifting hoist6 crate5)
   goals met: 4 of 6
26. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 4 of 6
27. (unload hoist7 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist7)
   added: (lifting hoist7 crate4)
   goals met: 4 of 6
28. (drop hoist6 crate5 pallet13 depot2)
   deleted: (lifting hoist6 crate5) (clear pallet13)
   added: (available hoist6) (at crate5 depot2) (clear crate5) (on crate5 pallet13)
   goals met: 5 of 6
29. (drop hoist7 crate4 pallet7 distributor0)
   deleted: (lifting hoist7 crate4) (clear pallet7)
   added: (available hoist7) (at crate4 distributor0) (clear crate4) (on crate4 pallet7)
   goals met: 6 of 6
